
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 100)]        0
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 1)]          0
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 101)]        0
__________________________________________________________________________________________________
embedding (Embedding)           (None, 100, 64)      6031872     input_1[0][0]
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 1, 1)         24          input_3[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 101)          404         input_2[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 6400)         0           embedding[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1)            0           embedding_1[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 6400)         652800      batch_normalization[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 12801)        0           flatten[0][0]
                                                                 flatten_1[0][0]
                                                                 dense[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 12801)        51204       concatenate[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 12801)        0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          3277312     dropout[0][0]
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 256)       0           dense_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1, 256)       1024        reshape[0][0]
__________________________________________________________________________________________________
lstm (LSTM)                     (None, 1, 256)       525312      batch_normalization_2[0][0]
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 16)           17472       lstm[0][0]
__________________________________________________________________________________________________
xy (Dense)                      (None, 2)            34          lstm_1[0][0]
==================================================================================================
Total params: 10,557,458
Trainable params: 10,531,142
