
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 100)]        0
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 1)]          0
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 100)]        0
__________________________________________________________________________________________________
embedding (Embedding)           (None, 100, 64)      6031872     input_1[0][0]
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 1, 2)         48          input_3[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 100)          400         input_2[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 6400)         0           embedding[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 2)            0           embedding_1[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 6400)         646400      batch_normalization[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 12802)        0           flatten[0][0]
                                                                 flatten_1[0][0]
                                                                 dense[0][0]
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 12802)     0           concatenate[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1, 12802)     51208       reshape[0][0]
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 1, 512)       26744832    batch_normalization_1[0][0]
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 64)           139520      bidirectional[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 64)           256         bidirectional_1[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           1040        batch_normalization_2[0][0]
__________________________________________________________________________________________________
floor (Dense)                   (None, 11)           187         dense_1[0][0]
==================================================================================================
Total params: 33,615,763
Trainable params: 33,589,831
Non-trainable params: 25,932
